TestPlans/Home/Legal & General Essentials/xml/LGE3_08122014_16.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ssp="http://SSP.Authentication.Services/" xmlns:tem="http://WebServices.ssp-uk.com/HouseholdAggregator/">
  <soap:Header>
    <ssp:Security>
      <ssp:SystemUsername>1045678055</ssp:SystemUsername>
      <ssp:SystemPassword>AE9ACEEC-D1CA-4BF9-8318-66C61EF5B74F</ssp:SystemPassword>
      <ssp:SystemID>2</ssp:SystemID>
    </ssp:Security>
  </soap:Header>
  <soap:Body>
    <tem:GetQuote>
      <tem:quote CoverStart="2014-12-08" CoverStartTime="00:00:00" IsMultiProposer="true" CoverType="ContentsAndBuildings" PaymentFrequency="U" PaymentFrequencyDescription="Unknown">
        <SingleQuoteRequest QuoteMultipleBroker="true" BrokerSCIDs="C00057-001,C00057-002" />
        <Proposer ProposerType="MainProposer" RelationshipToProposer="P" DateOfBirth="1975-04-17" Sex="Female" MaritalStatus="Single" IsSmoker="false" FirstTimeBuyer="false" HasConvictions="false" HasCcj="false" HasPolicyRefused="false" DateResidencyStarted="2014-12-08" EmailAddress="michael.hudson@emailreaction.org" Title="Ms" FirstName="Penelope" LastName="Siteen" DayTimePhone="01778852852">
          <Occupation IsFullTime="true" EmploymentStatus="NotEmployedDueToDisability" OccupationCode="220" BusinessCode="186" />
          <CorrespondenceAddress HouseName="" AddressLine1="15 High Street" AddressLine2="Market Deeping" AddressLine3="Peterborough" AddressLine4="Cambridgeshire" Postcode="PE6 8ED" />
        </Proposer>
        <Proposer ProposerType="CoProposer" RelationshipToProposer="F" DateOfBirth="1960-01-01" Sex="Male" MaritalStatus="Widowed" IsSmoker="false" FirstTimeBuyer="false" HasConvictions="false" HasCcj="false" HasPolicyRefused="false" DateResidencyStarted="2014-12-08" Title="Mr" FirstName="Joint" LastName="Policyholder">
          <Occupation IsFullTime="true" EmploymentStatus="NotEmployedDueToDisability" OccupationCode="220" BusinessCode="186" />
        </Proposer>
        <Claim Cost="1000" IsCurrentAddress="false" Date="2010-01-01" ClaimType="09" CoverType="Contents" />
        <Premises YearBuilt="1993" PremisesType="10" NumberOfBedrooms="5" NumberOfBathrooms="1" TotalNumberOfRooms="15" IsOccupiedNight="true" OccupancyStatus="HolidayHome" OwnerShipType="03" IsSoleOccupancy="true" ListedBuildingType="3" IsUsedForBusiness="false" IsClericalWorkOnly="false" SelfContainedAndLockable="true" MaxDaysUnoccupied="30" HasSmokeDetector="true" SecurityDeviceDiscountRequired="false" IsFurnished="true" OccupantsOver18="0" OccupantsUnder18="0" HasExteriorLighting="false" IsSecurityActivated="false" ConstructionWall="20" ConstructionRoof="13" RoofFlatPercentage="51" IsFreeFromFlooding="true" IsNearRiverBank="false" IsGoodStateOfRepair="true" IsSOMaintained="false" IsTreesVicinity="false" HasExtension="false" IsOccupiedDay="true" HasStandardAlarm="false" AlarmProfMaintained="" HasApprovedAlarm="" MemberOfNeighbourHoodWatch="true" HasSafeInstalled="true" HasApprovedLocks="true" MainDoorLockType="240" HasPatioDoors="false" HasOtherDoors="false" AccessibleWindowLocks="KeyOperatedLocks" IsFreeFromSubsidence="true" IsFreeFromUnderpinning="true">
          <Address HouseName="" AddressLine1="15 High Street" AddressLine2="Market Deeping" AddressLine3="Peterborough" AddressLine4="Cambridgeshire" Postcode="PE6 8ED" />
        </Premises>
        <CoverRequired>
          <Buildings RebuildingCost="100000" IsAccidentalDamageRequired="false" VoluntaryExcess="100" IsFullValue="true" />
          <Contents ValuablesSumInsured="4000" ContentsCoverType="NewForOld" IsAccidentalDamageRequired="false" VoluntaryExcess="100" IsFullReplacementValue="true" ValueMostExpensiveItem="4000" AllRisksRequired="false" PersonalEffectsSumInsured="0" TotalSumInsured="40000">
            <SpecifiedItems>
              <SpecifiedItem ItemType="A05" Description="Robin Hood bow" Value="2800" />
              <SpecifiedItem ItemType="C15" Description="World Cup" Value="4500" />
            </SpecifiedItems>
          </Contents>
        </CoverRequired>
      </tem:quote>
      <tem:sourceOfBusiness>CompareTheMarket</tem:sourceOfBusiness>
    </tem:GetQuote>
  </soap:Body>
</soap:Envelope>